// Lil' UEFI Header
// Version 0.1 - AUG 21 2022
//
// based on UEFI spec 2.7 (https://uefi.org/sites/default/files/resources/UEFI_Spec_2_7.pdf)
// NOT FULL COVERAGE OF THE SPEC - NOT PRECISELY FOLLOWING EVERY DETAIL GIVEN IN THE SPEC
//
// Made for use by authors of UEFI applications.
// Go learn how to make operating systems!



////////////////////////////////
// LICENSE
//
//   This software is in the public domain. Where that dedication is not
//   recognized, you are granted a perpetual, irrevocable license to copy,
//   distribute, and modify this file as you see fit.



////////////////////////////////
// Notes on Lil' UEFI design choices

// 1. Renaming:
//    This header does not 100% follow the naming scheme given by the spec.
// For type names and functions the naming scheme has been left unchanged,
// the names of enum values and constants in the spec are not given with
// namespace prefixes - which we believe is a serious organizational flaw.
// In this header all such constants are prefixed with the name of the
// enum type or some other appropriate namespacing prefix.

// 2. Function Types:
//    The spec gives function pointer typedefs with specific names for every
// function in every function table. This leads to spreading out information,
// some confusing name disagreements and a lot more code. In this header the
// function types are named EFI_##name-of-function-table##_##name-of-function.

#  define LIL_UEFI_ARCH_ARM64 1
# else
#  error missing ARCH detection
# endif

#elif defined(_MSC_VER)
# define LIL_UEFI_COMPILER_CL 1

# if defined(_M_AMD64)
#  define LIL_UEFI_ARCH_X64 1
# elif defined(_M_I86)
#  define LIL_UEFI_ARCH_X86 1
# elif defined(_M_ARM)
#  define LIL_UEFI_ARCH_ARM 1
// TODO(allen): ARM64?
# else
#  error missing ARCH detection
# endif

#elif defined(__GNUC__)
# define LIL_UEFI_COMPILER_GCC 1

# if defined(__amd64__)
#  define LIL_UEFI_ARCH_X64 1
# elif defined(__i386__)
#  define LIL_UEFI_ARCH_X86 1
# elif defined(__arm__)
#  define LIL_UEFI_ARCH_ARM 1
# elif defined(__aarch64__)
#  define LIL_UEFI_ARCH_ARM64 1
# else
#  error missing ARCH detection
# endif

#else
# error no context cracking for this compiler
#endif

// Zero fill missing context macros
#if !defined(LIL_UEFI_COMPILER_CL)
# define LIL_UEFI_COMPILER_CL 0
#endif
#if !defined(LIL_UEFI_COMPILER_CLANG)
# define LIL_UEFI_COMPILER_CLANG 0
#endif
#if !defined(LIL_UEFI_COMPILER_GCC)
# define LIL_UEFI_COMPILER_GCC 0
#endif
#if !defined(LIL_UEFI_ARCH_X64)
# define LIL_UEFI_ARCH_X64 0
#endif
#if !defined(LIL_UEFI_ARCH_X86)
# define LIL_UEFI_ARCH_X86 0
#endif
#if !defined(LIL_UEFI_ARCH_ARM)
# define LIL_UEFI_ARCH_ARM 0
#endif
#if !defined(LIL_UEFI_ARCH_ARM64)
# define LIL_UEFI_ARCH_ARM64 0
#endif

////////////////////////////////
// Basic Types & Constants - Overridable

#if !defined(LIL_UEFI_DISABLE_DEFAULT_INTEGERS)

// SPEC: Table 5

typedef char      EFI_INT8;
typedef short     EFI_INT16;
typedef int       EFI_INT32;
typedef long long EFI_INT64;
typedef unsigned char      EFI_UINT8;
typedef unsigned short     EFI_UINT16;
typedef unsigned int       EFI_UINT32;
typedef unsigned long long EFI_UINT64;

#define EFI_INT8   EFI_INT8
#define EFI_INT16  EFI_INT16
#define EFI_INT32  EFI_INT32
#define EFI_INT64  EFI_INT64
#define EFI_UINT8  EFI_UINT8
#define EFI_UINT16 EFI_UINT16
#define EFI_UINT32 EFI_UINT32
#define EFI_UINT64 EFI_UINT64


#if LIL_UEFI_ARCH_X64 || LIL_UEFI_ARCH_ARM64
typedef EFI_INT64  EFI_INTN;
typedef EFI_UINT64 EFI_UINTN;
#else
typedef EFI_INT32  EFI_INTN;
typedef EFI_UINT32 EFI_UINTN;
#endif


#define EFI_INTN  EFI_INTN
#define EFI_UINTN EFI_UINTN

#endif


////////////////////////////////
// Overridables Check

#if !defined(EFI_INT8)
# error Missing EFI_INT8
#endif
#if !defined(EFI_INT16)
# error Missing EFI_INT16
#endif
#if !defined(EFI_INT32)
# error Missing EFI_INT32
#endif
#if !defined(EFI_INT64)
# error Missing EFI_INT64
#endif

#if !defined(EFI_UINT8)
# error Missing EFI_UINT8
#endif
#if !defined(EFI_UINT16)
# error Missing EFI_UINT16
#endif
#if !defined(EFI_UINT32)
# error Missing EFI_UINT32
#endif
#if !defined(EFI_UINT64)
# error Missing EFI_UINT64
#endif

#if !defined(EFI_INTN)
# error Missing EFI_INTN
#endif
#if !defined(EFI_UINTN)
# error Missing EFI_UINTN
#endif


#if !defined(LIL_UEFI_DISABLE_INTEGER_SIZE_CHECKS)

#define LIL_UEFI_GLUE(a,b) a##b
#define LIL_UEFI_STATIC_ASSERT(c) char LIL_UEFI_GLUE(efi_static_assert_, __LINE__)[(c)?(1):(-1)]

LIL_UEFI_STATIC_ASSERT(sizeof(EFI_INT8) == 1);
LIL_UEFI_STATIC_ASSERT(sizeof(EFI_INT16) == 2);
LIL_UEFI_STATIC_ASSERT(sizeof(EFI_INT32) == 4);
LIL_UEFI_STATIC_ASSERT(sizeof(EFI_INT64) == 8);

LIL_UEFI_STATIC_ASSERT(sizeof(EFI_UINT8) == 1);
LIL_UEFI_STATIC_ASSERT(sizeof(EFI_UINT16) == 2);
LIL_UEFI_STATIC_ASSERT(sizeof(EFI_UINT32) == 4);
LIL_UEFI_STATIC_ASSERT(sizeof(EFI_UINT64) == 8);

LIL_UEFI_STATIC_ASSERT(sizeof(EFI_INTN) == sizeof(void*));
LIL_UEFI_STATIC_ASSERT(sizeof(EFI_UINTN) == sizeof(void*));

#endif

////////////////////////////////
// Basic Types & Constants

// SPEC: Table 5

typedef EFI_UINT8  EFI_BOOLEAN;
typedef EFI_UINT8  EFI_CHAR8;
typedef EFI_UINT16 EFI_CHAR16;

typedef struct EFI_GUID{
    EFI_UINT32 data1;
    EFI_UINT16 data2;
    EFI_UINT16 data3;
    EFI_UINT8  data4[8];
} EFI_GUID;

#define EFI_GuidVal(a,b,c,x0,x1,x2,x3,x4,x5,x6,x7) {a,b,c,{x0,x1,x2,x3,x4,x5,x6,x7}}

typedef EFI_UINTN EFI_STATUS;
typedef void*     EFI_HANDLE;
typedef void*     EFI_EVENT;

typedef EFI_UINT64 EFI_LBA;
typedef EFI_UINTN  EFI_TPL;

typedef struct EFI_MAC_ADDRESS{
    EFI_UINT8 addr[32];
} EFI_MAC_ADDRESS;

typedef struct EFI_IPv4_ADDRESS{
    EFI_UINT8 addr[4];
} EFI_IPv4_ADDRESS;

typedef struct EFI_IPv6_ADDRESS{
    EFI_UINT8 addr[16];
} EFI_IPv6_ADDRESS;

typedef struct EFI_IP_ADDRESS{
    EFI_UINT8 addr[16];
